app/controllers/beacons_controller.rb

  def index
    @beacons = Beacon.all
---
SELECT * FROM "beacons" WHERE ((latitude < ('45.50226688' + .00001) AND latitude >= ('45.50226688' - .00001) AND longitude < ('45.50226688' + .00001) AND longitude >= ('45.50226688' - .00001)) AND (timestamp > '2011-04-06 11:04:44'))

  def create
    @beacon = Beacon.new(params[:beacon])

    respond_to do |format|
      if @beacon.save
---
INSERT INTO "beacons" ("latitude", "created_at", "timestamp", "updated_at", "longitude", "user") VALUES(45.5022816, '2011-04-13 19:16:39', NULL, '2011-04-13 19:16:39', -122.6265122, NULL)